In [383]:
import pandas as pd

xlsx = pd.ExcelFile('../Downloads/Moving annual rent by suburb - March quarter 2023.xlsx')

dfs = []

for sheet_name in xlsx.sheet_names:

    df = pd.read_excel(xlsx, sheet_name=sheet_name, header=1)
    df = df.iloc[:, 1:]
    df = df.drop(0, axis=0)
    
    df.columns = ['Suburb'] + df.columns[1:].tolist()
    
    date_columns = df.columns[1::2]  
    unnamed_columns = df.columns[2::2]  

    rename_dict = {}
    for date_col, unnamed_col in zip(date_columns, unnamed_columns):
        if 'Unnamed' in unnamed_col:
            new_name = f"{date_col}_median"  
            rename_dict[unnamed_col] = new_name
    
    df = df.rename(columns=rename_dict)
    
    df['property type'] = sheet_name
    
    date_rename = {}
    for date_col in date_columns:
        count_name = f"{date_col}_count"
        date_rename[date_col] = count_name
    
    df = df.rename(columns=date_rename)

    dfs.append(df)

merged_df = pd.concat(dfs, ignore_index=True)

In [384]:
merged_df

,Suburb,Mar 2000_count,Mar 2000_median,Jun 2000_count,Jun 2000_median,Sep 2000_count,Sep 2000_median,Dec 2000_count,Dec 2000_median,Mar 2001_count,...,Mar 2022_median,Jun 2022_count,Jun 2022_median,Sep 2022_count,Sep 2022_median,Dec 2022_count,Dec 2022_median,Mar 2023_count,Mar 2023_median,property type
0,Albert Park-Middle Park-West St Kilda,352,165,347,165,378,170,369,175,395,...,315,262,325,277,340,260,350,262,360,1 bedroom flat
1,Armadale,210,150,212,150,213,155,213,160,206,...,310,233,320,237,340,238,350,204,360,1 bedroom flat
2,Carlton North,87,150,78,155,74,150,65,150,73,...,300,68,320,72,320,71,330,64,373,1 bedroom flat
3,Carlton-Parkville,303,165,300,170,315,175,351,180,360,...,259,3544,269,4296,300,4203,309,4488,352,1 bedroom flat
4,CBD-St Kilda Rd,755,250,861,250,934,250,952,250,1145,...,320,8619,340,9913,365,9638,390,9781,430,1 bedroom flat
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1108,Wanagaratta,705,125,671,125,631,130,623,130,602,...,370,530,380,547,380,541,380,518,380,All properties
1109,Warragul,385,130,367,135,382,135,366,135,365,...,400,512,400,515,420,523,430,497,440,All properties
1110,Warrnambool,1266,130,1229,135,1204,135,1135,135,1069,...,400,844,400,870,420,859,420,867,420,All properties
1111,Wodonga,1446,145,1439,145,1468,150,1449,150,1405,...,380,1267,390,1251,400,1191,410,1173,410,All properties
1112,Group Total,13812,130,13758,130,13842,130,13636,130,13285,...,360,12089,365,12258,380,12072,380,11944,390,All properties

In [385]:
df = pd.DataFrame(merged_df)

# Function to reshape DataFrame
def reshape_data(df):
    reshaped_data = []

    # Iterate through each row in the DataFrame
    for _, row in df.iterrows():
        suburb = row['Suburb']
        property_type = row['property type']
        
        # For each count and median column, add a new row to reshaped_data
        for col in df.columns:
            if '_count' in col:
                date = col.replace('_count', '')
                count_value = row[col]
                median_col = f'{date}_median'
                median_value = row[median_col] if median_col in df.columns else None
                reshaped_data.append([suburb, count_value, median_value, date, property_type])
    
    # Create a new DataFrame from the reshaped data
    reshaped_df = pd.DataFrame(reshaped_data, columns=['Suburb', 'Count', 'Median', 'Date', 'Property Type'])
    
    return reshaped_df

# Apply reshaping function
df_reshaped = reshape_data(df)

In [386]:
df_reshaped

,Suburb,Count,Median,Date,Property Type
0,Albert Park-Middle Park-West St Kilda,352,165,Mar 2000,1 bedroom flat
1,Albert Park-Middle Park-West St Kilda,347,165,Jun 2000,1 bedroom flat
2,Albert Park-Middle Park-West St Kilda,378,170,Sep 2000,1 bedroom flat
3,Albert Park-Middle Park-West St Kilda,369,175,Dec 2000,1 bedroom flat
4,Albert Park-Middle Park-West St Kilda,395,180,Mar 2001,1 bedroom flat
...,...,...,...,...,...
103504,Group Total,12149,360,Mar 2022,All properties
103505,Group Total,12089,365,Jun 2022,All properties
103506,Group Total,12258,380,Sep 2022,All properties
103507,Group Total,12072,380,Dec 2022,All properties
103508,Group Total,11944,390,Mar 2023,All properties

In [387]:
df_cleaned = df_reshaped[df_reshaped['Suburb'] != 'Group Total']

In [388]:
df_cleaned['Count'] = pd.to_numeric(df_cleaned['Count'], errors='coerce')
df_cleaned['Median'] = pd.to_numeric(df_cleaned['Median'], errors='coerce')

/var/folders/_j/twr8x6q52wn1cwysdlwr0lbc0000gn/T/ipykernel_7224/4123728603.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Count'] = pd.to_numeric(df_cleaned['Count'], errors='coerce')
/var/folders/_j/twr8x6q52wn1cwysdlwr0lbc0000gn/T/ipykernel_7224/4123728603.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Median'] = pd.to_numeric(df_cleaned['Median'], errors='coerce')

In [389]:
df_cleaned

,Suburb,Count,Median,Date,Property Type
0,Albert Park-Middle Park-West St Kilda,352.0,165.0,Mar 2000,1 bedroom flat
1,Albert Park-Middle Park-West St Kilda,347.0,165.0,Jun 2000,1 bedroom flat
2,Albert Park-Middle Park-West St Kilda,378.0,170.0,Sep 2000,1 bedroom flat
3,Albert Park-Middle Park-West St Kilda,369.0,175.0,Dec 2000,1 bedroom flat
4,Albert Park-Middle Park-West St Kilda,395.0,180.0,Mar 2001,1 bedroom flat
...,...,...,...,...,...
103411,Wodonga,1233.0,380.0,Mar 2022,All properties
103412,Wodonga,1267.0,390.0,Jun 2022,All properties
103413,Wodonga,1251.0,400.0,Sep 2022,All properties
103414,Wodonga,1191.0,410.0,Dec 2022,All properties
103415,Wodonga,1173.0,410.0,Mar 2023,All properties

In [390]:
df_cleaned['Total_Price'] = df_cleaned['Count'] * df_cleaned['Median']
df_cleaned

/var/folders/_j/twr8x6q52wn1cwysdlwr0lbc0000gn/T/ipykernel_7224/1462032531.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Total_Price'] = df_cleaned['Count'] * df_cleaned['Median']

,Suburb,Count,Median,Date,Property Type,Total_Price
0,Albert Park-Middle Park-West St Kilda,352.0,165.0,Mar 2000,1 bedroom flat,58080.0
1,Albert Park-Middle Park-West St Kilda,347.0,165.0,Jun 2000,1 bedroom flat,57255.0
2,Albert Park-Middle Park-West St Kilda,378.0,170.0,Sep 2000,1 bedroom flat,64260.0
3,Albert Park-Middle Park-West St Kilda,369.0,175.0,Dec 2000,1 bedroom flat,64575.0
4,Albert Park-Middle Park-West St Kilda,395.0,180.0,Mar 2001,1 bedroom flat,71100.0
...,...,...,...,...,...,...
103411,Wodonga,1233.0,380.0,Mar 2022,All properties,468540.0
103412,Wodonga,1267.0,390.0,Jun 2022,All properties,494130.0
103413,Wodonga,1251.0,400.0,Sep 2022,All properties,500400.0
103414,Wodonga,1191.0,410.0,Dec 2022,All properties,488310.0
103415,Wodonga,1173.0,410.0,Mar 2023,All properties,480930.0

In [391]:
df_cleaned

,Suburb,Count,Median,Date,Property Type,Total_Price
0,Albert Park-Middle Park-West St Kilda,352.0,165.0,Mar 2000,1 bedroom flat,58080.0
1,Albert Park-Middle Park-West St Kilda,347.0,165.0,Jun 2000,1 bedroom flat,57255.0
2,Albert Park-Middle Park-West St Kilda,378.0,170.0,Sep 2000,1 bedroom flat,64260.0
3,Albert Park-Middle Park-West St Kilda,369.0,175.0,Dec 2000,1 bedroom flat,64575.0
4,Albert Park-Middle Park-West St Kilda,395.0,180.0,Mar 2001,1 bedroom flat,71100.0
...,...,...,...,...,...,...
103411,Wodonga,1233.0,380.0,Mar 2022,All properties,468540.0
103412,Wodonga,1267.0,390.0,Jun 2022,All properties,494130.0
103413,Wodonga,1251.0,400.0,Sep 2022,All properties,500400.0
103414,Wodonga,1191.0,410.0,Dec 2022,All properties,488310.0
103415,Wodonga,1173.0,410.0,Mar 2023,All properties,480930.0

In [392]:
df_cleaned[['Month', 'Year']] = df_cleaned['Date'].str.split(' ', expand=True)
df_cleaned = df_cleaned.drop('Date', axis=1)
df_cleaned['Year'] = pd.to_numeric(df_cleaned['Year'], errors='coerce')

/var/folders/_j/twr8x6q52wn1cwysdlwr0lbc0000gn/T/ipykernel_7224/1314529076.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned[['Month', 'Year']] = df_cleaned['Date'].str.split(' ', expand=True)
/var/folders/_j/twr8x6q52wn1cwysdlwr0lbc0000gn/T/ipykernel_7224/1314529076.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned[['Month', 'Year']] = df_cleaned['Date'].str.split(' ', expand=True)

In [393]:
df_cleaned['Year'] = df_cleaned['Year'].astype(int)

In [394]:
df_cleaned

,Suburb,Count,Median,Property Type,Total_Price,Month,Year
0,Albert Park-Middle Park-West St Kilda,352.0,165.0,1 bedroom flat,58080.0,Mar,2000
1,Albert Park-Middle Park-West St Kilda,347.0,165.0,1 bedroom flat,57255.0,Jun,2000
2,Albert Park-Middle Park-West St Kilda,378.0,170.0,1 bedroom flat,64260.0,Sep,2000
3,Albert Park-Middle Park-West St Kilda,369.0,175.0,1 bedroom flat,64575.0,Dec,2000
4,Albert Park-Middle Park-West St Kilda,395.0,180.0,1 bedroom flat,71100.0,Mar,2001
...,...,...,...,...,...,...,...
103411,Wodonga,1233.0,380.0,All properties,468540.0,Mar,2022
103412,Wodonga,1267.0,390.0,All properties,494130.0,Jun,2022
103413,Wodonga,1251.0,400.0,All properties,500400.0,Sep,2022
103414,Wodonga,1191.0,410.0,All properties,488310.0,Dec,2022
103415,Wodonga,1173.0,410.0,All properties,480930.0,Mar,2023

In [395]:
df_cleaned['Property Type'] = df_cleaned['Property Type'].str.split(' ').str[-1]

df_cleaned = df_cleaned.groupby(['Suburb', 'Month', 'Year', 'Property Type'], as_index=False).agg({
    'Count': 'sum', 
    'Total_Price': 'sum' 
})
df_cleaned['Median'] = df_cleaned['Total_Price'] / df_cleaned['Count']

In [396]:
df_cleaned

,Suburb,Month,Year,Property Type,Count,Total_Price,Median
0,Albert Park-Middle Park-West St Kilda,Dec,2000,flat,700.0,152126.0,217.322857
1,Albert Park-Middle Park-West St Kilda,Dec,2000,house,274.0,98998.0,361.306569
2,Albert Park-Middle Park-West St Kilda,Dec,2000,properties,1178.0,323950.0,275.000000
3,Albert Park-Middle Park-West St Kilda,Dec,2001,flat,768.0,183210.0,238.554688
4,Albert Park-Middle Park-West St Kilda,Dec,2001,house,311.0,123771.0,397.977492
...,...,...,...,...,...,...,...
40291,Yarraville-Seddon,Sep,2021,house,627.0,350847.0,559.564593
40292,Yarraville-Seddon,Sep,2021,properties,1351.0,648480.0,480.000000
40293,Yarraville-Seddon,Sep,2022,flat,606.0,225480.0,372.079208
40294,Yarraville-Seddon,Sep,2022,house,702.0,394562.0,562.054131
40295,Yarraville-Seddon,Sep,2022,properties,1437.0,682575.0,475.000000

In [402]:
new_count = df_cleaned.groupby(['Suburb', 'Month', 'Year', 'Property Type'])['Count'].sum().unstack(fill_value=0)
new_count['Count'] = new_count.get('properties', 0) - new_count.drop(columns=['properties'], errors='ignore').sum(axis=1)
new_count_result= new_count[['Count']].reset_index()

In [403]:
new_count_result

Property Type                                 Suburb Month  Year  Count
0              Albert Park-Middle Park-West St Kilda   Dec  2000  204.0
1              Albert Park-Middle Park-West St Kilda   Dec  2001  214.0
2              Albert Park-Middle Park-West St Kilda   Dec  2003  443.0
3              Albert Park-Middle Park-West St Kilda   Dec  2004  274.0
4              Albert Park-Middle Park-West St Kilda   Dec  2005  231.0
...                                              ...   ...   ...    ...
13427                              Yarraville-Seddon   Sep  2018  116.0
13428                              Yarraville-Seddon   Sep  2019  152.0
13429                              Yarraville-Seddon   Sep  2020  141.0
13430                              Yarraville-Seddon   Sep  2021  128.0
13431                              Yarraville-Seddon   Sep  2022  129.0

[13432 rows x 4 columns]

In [404]:
new_price = df_cleaned.groupby(['Suburb', 'Month', 'Year', 'Property Type'])['Total_Price'].sum().unstack(fill_value=0)

# 计算 All properties 和 Other properties 的差异
new_price['Total_Price'] = new_price.get('properties', 0) - new_price.drop(columns=['properties'], errors='ignore').sum(axis=1)

# 选择包含差异的rice结果
new_price_result= new_price[['Total_Price']].reset_index()

In [405]:
new_price_result

Property Type                                 Suburb Month  Year  Total_Price
0              Albert Park-Middle Park-West St Kilda   Dec  2000      72826.0
1              Albert Park-Middle Park-West St Kilda   Dec  2001      67989.0
2              Albert Park-Middle Park-West St Kilda   Dec  2003     142685.0
3              Albert Park-Middle Park-West St Kilda   Dec  2004      82405.0
4              Albert Park-Middle Park-West St Kilda   Dec  2005      67900.0
...                                              ...   ...   ...          ...
13427                              Yarraville-Seddon   Sep  2018      65715.0
13428                              Yarraville-Seddon   Sep  2019      92920.0
13429                              Yarraville-Seddon   Sep  2020      88745.0
13430                              Yarraville-Seddon   Sep  2021      79593.0
13431                              Yarraville-Seddon   Sep  2022      62533.0

[13432 rows x 4 columns]

In [406]:
for index, row in new_price_result.iterrows():
    mask = (
        (df_cleaned['Suburb'] == row['Suburb']) &
        (df_cleaned['Month'] == row['Month']) &
        (df_cleaned['Year'] == row['Year']) &
        (df_cleaned['Property Type'] == 'properties')
    )
    df_cleaned.loc[mask, 'Total_Price'] = row['Total_Price']

In [407]:
for index, row in new_count_result.iterrows():
    mask = (
        (df_cleaned['Suburb'] == row['Suburb']) &
        (df_cleaned['Month'] == row['Month']) &
        (df_cleaned['Year'] == row['Year']) &
        (df_cleaned['Property Type'] == 'properties')
    )
    df_cleaned.loc[mask, 'Count'] = row['Count']

In [408]:
df_cleaned

,Suburb,Month,Year,Property Type,Count,Total_Price,Median
0,Albert Park-Middle Park-West St Kilda,Dec,2000,flat,700.0,152126.0,217.322857
1,Albert Park-Middle Park-West St Kilda,Dec,2000,house,274.0,98998.0,361.306569
2,Albert Park-Middle Park-West St Kilda,Dec,2000,properties,204.0,72826.0,275.000000
3,Albert Park-Middle Park-West St Kilda,Dec,2001,flat,768.0,183210.0,238.554688
4,Albert Park-Middle Park-West St Kilda,Dec,2001,house,311.0,123771.0,397.977492
...,...,...,...,...,...,...,...
40291,Yarraville-Seddon,Sep,2021,house,627.0,350847.0,559.564593
40292,Yarraville-Seddon,Sep,2021,properties,128.0,79593.0,480.000000
40293,Yarraville-Seddon,Sep,2022,flat,606.0,225480.0,372.079208
40294,Yarraville-Seddon,Sep,2022,house,702.0,394562.0,562.054131
40295,Yarraville-Seddon,Sep,2022,properties,129.0,62533.0,475.000000

In [409]:
median_all_properties = df_cleaned.loc[df_cleaned['Property Type'] == 'properties', 'Total_Price'] / df_cleaned.loc[df_cleaned['Property Type'] == 'properties', 'Count']
df_cleaned.loc[df_cleaned['Property Type'] == 'properties', 'Median'] = median_all_properties

df_cleaned.loc[df_cleaned['Property Type'] == 'properties', 'Property Type'] = 'Other properties'

In [410]:
df_cleaned

,Suburb,Month,Year,Property Type,Count,Total_Price,Median
0,Albert Park-Middle Park-West St Kilda,Dec,2000,flat,700.0,152126.0,217.322857
1,Albert Park-Middle Park-West St Kilda,Dec,2000,house,274.0,98998.0,361.306569
2,Albert Park-Middle Park-West St Kilda,Dec,2000,Other properties,204.0,72826.0,356.990196
3,Albert Park-Middle Park-West St Kilda,Dec,2001,flat,768.0,183210.0,238.554688
4,Albert Park-Middle Park-West St Kilda,Dec,2001,house,311.0,123771.0,397.977492
...,...,...,...,...,...,...,...
40291,Yarraville-Seddon,Sep,2021,house,627.0,350847.0,559.564593
40292,Yarraville-Seddon,Sep,2021,Other properties,128.0,79593.0,621.820312
40293,Yarraville-Seddon,Sep,2022,flat,606.0,225480.0,372.079208
40294,Yarraville-Seddon,Sep,2022,house,702.0,394562.0,562.054131
40295,Yarraville-Seddon,Sep,2022,Other properties,129.0,62533.0,484.751938